rednblkx/HomeKey-ESP32/main/NfcManager.cpp
    m_nfc->inRelease();
}

/**
 * @brief Authenticate a detected HomeKey applet and publish the result.
 *
 * Attempts authentication using the configured authentication flow and current reader data.
 * On success, updates stored reader data and publishes a HOMEKEY_TAP event containing success,
 * issuer ID, endpoint ID, and reader ID. On failure, publishes a HOMEKEY_TAP event indicating failure.
 *
 * @note This function may use a cached precomputed authentication context when available,
 * invalidate or update ReaderDataManager state, and publish events on the NFC bus topic.
 */
void NfcManager::handleHomeKeyAuth() {
    auto publishAuthResult = [](
        const std::tuple<std::vector<uint8_t>, std::vector<uint8_t>, KeyFlow>& authResult,
        const std::vector<uint8_t>& readerId
    ) {
        if (std::get<2>(authResult) != kFlowFailed) {
            ESP_LOGI(TAG, "HomeKey authentication successful!");
            EventHKTap s{.status = true, .issuerId = std::get<0>(authResult), .endpointId = std::get<1>(authResult), .readerId = readerId };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            event_bus.publish({event_bus.get_topic(NFC_BUS_TOPIC).value_or(EventBus::INVALID_TOPIC), 0, event_data.data(), event_data.size()});
        } else {
            ESP_LOGW(TAG, "HomeKey authentication failed.");
            EventHKTap s{.status = false, .issuerId = {}, .endpointId = {}, .readerId = {} };
            std::vector<uint8_t> d;
            alpaca::serialize(s, d);
            NfcEvent event{.type=HOMEKEY_TAP, .data=d};
            std::vector<uint8_t> event_data;
            alpaca::serialize(event, event_data);
            event_bus.publish({event_bus.get_topic(NFC_BUS_TOPIC).value_or(EventBus::INVALID_TOPIC), 0, event_data.data(), event_data.size()});
        }
    };

    auto authenticateCold = [this, &publishAuthResult]() {
        readerData_t readerData = m_readerDataManager.getReaderDataCopy();

        // IMPORTANT: HKAuthenticationContext stores references to std::function objects.
        // Do NOT pass lambdas directly (would bind to temporaries and dangle).
        std::function<bool(std::vector<uint8_t>&, std::vector<uint8_t>&, bool)> nfcFn =
            [this](std::vector<uint8_t>& send, std::vector<uint8_t>& recv, bool isLong) -> bool {
                if (send.size() > 255) {
                    return false;
                }
                uint8_t sendLength = static_cast<uint8_t>(send.size());
                uint8_t responseBuffer[256];
                uint16_t responseLength = sizeof(responseBuffer);
                bool ok = m_nfc->inDataExchange(send.data(), sendLength, responseBuffer, &responseLength, isLong);
                if (ok) {
                    recv.assign(responseBuffer, responseBuffer + responseLength);
                }
                return ok;
            };
        std::function<void(const readerData_t&)> saveFn = [this](const readerData_t& data) {
            m_readerDataManager.updateReaderData(data);
            invalidateAuthCache();
        };

        HKAuthenticationContext authCtx(nfcFn, readerData, saveFn);
        auto authResult = authCtx.authenticate(authFlow);
        publishAuthResult(authResult, readerData.reader_id);
    };

    if (!m_hkAuthPrecomputeEnabled) {
        authenticateCold();
        return;
    }

    const UBaseType_t readyBefore = m_authCtxReadyQueue ? uxQueueMessagesWaiting(m_authCtxReadyQueue) : 0;
    const UBaseType_t freeBefore = m_authCtxFreeQueue ? uxQueueMessagesWaiting(m_authCtxFreeQueue) : 0;
    const uint32_t genNow = m_readerDataGeneration.load(std::memory_order_relaxed);

    AuthCtxCacheItem* item = nullptr;
    bool gotCached = false;
    if (m_authCtxReadyQueue && xQueueReceive(m_authCtxReadyQueue, &item, 0) == pdTRUE) {
      if (item && item->ctx) {
        gotCached = true;
      } else if (item) {
        ESP_LOGW(TAG, "Auth cache item dequeued without context, returning to free queue.");
        if (m_authCtxFreeQueue) {
          xQueueSend(m_authCtxFreeQueue, &item, 0);
        }
        item = nullptr;
      }
    }

    if (gotCached) {
      const bool genMatch = (item->generation == genNow);
      if (!genMatch) {
        ESP_LOGW(TAG, "Auth cache stale (itemGen=%u, genNow=%u) -> cold init.", item->generation, genNow);
        delete item->ctx;
        item->ctx = nullptr;
        xQueueSend(m_authCtxFreeQueue, &item, 0);
        item = nullptr;
      } else {
        const UBaseType_t readyAfter = uxQueueMessagesWaiting(m_authCtxReadyQueue);
        const UBaseType_t freeAfter = m_authCtxFreeQueue ? uxQueueMessagesWaiting(m_authCtxFreeQueue) : 0;
        ESP_LOGI(TAG, "Auth cache hit (gen=%u, free=%u->%u, ready=%u->%u).",
                 genNow, freeBefore, freeAfter, readyBefore, readyAfter);
        if (m_authPrecomputeTaskHandle) {
          xTaskNotifyGive(m_authPrecomputeTaskHandle);
        }

        auto authResult = item->ctx->authenticate(authFlow);
        const auto readerId = item->readerData.reader_id;
        delete item->ctx;
        item->ctx = nullptr;
        xQueueSend(m_authCtxFreeQueue, &item, 0);
        publishAuthResult(authResult, readerId);
        return;
      }
    }

    ESP_LOGI(TAG, "Auth cache miss (gen=%u, free=%u, ready=%u) -> cold init.", genNow, freeBefore, readyBefore);
    if (m_authPrecomputeTaskHandle) {
      xTaskNotifyGive(m_authPrecomputeTaskHandle);
    }
    authenticateCold();
}

/**
 * @brief Publish a TAG_TAP event for a detected non-HomeKey NFC tag on the NFC bus.
 *
 * Builds an EventTagTap containing the tag UID, ATQA, and SAK, serializes it into
 * an NfcEvent payload, and publishes the payload to the NFC event topic.
 *
 * @param uid Pointer to the tag UID bytes.
 * @param uidLen Number of bytes in `uid`.
 * @param atqa Pointer to the 2-byte ATQA value (must point to two bytes).
 * @param sak Pointer to the 1-byte SAK value (must point to one byte).
 */
void NfcManager::handleGenericTag(const uint8_t* uid, uint8_t uidLen, const uint8_t* atqa, const uint8_t* sak) {
    EventTagTap s{.uid = std::vector<uint8_t>(uid, uid+uidLen), .atqa = std::vector<uint8_t>(atqa, atqa + 2), .sak = std::vector<uint8_t>(sak, sak + 1)};
    std::vector<uint8_t> d;
    alpaca::serialize(s, d);
    NfcEvent event{.type=TAG_TAP, .data=d};
    std::vector<uint8_t> event_data;
    alpaca::serialize(event, event_data);
    event_bus.publish({event_bus.get_topic(NFC_BUS_TOPIC).value_or(EventBus::INVALID_TOPIC), 0, event_data.data(), event_data.size()});
}

/**
 * @brief Waits for an NFC tag to be removed from the reader's RF field and recovers if it remains.
 *
 * Polls the reader for tag presence up to 50 times with 50 ms intervals, calling inRelease between checks.
 * If the tag remains after the timeout, forces an RF field reset (toggle off/on) to clear the tag state.
 * Always issues a final inRelease before returning.
 */
void NfcManager::waitForTagRemoval() {
    ESP_LOGD(TAG, "Waiting for tag to be removed from field...");
    int counter = 50;
    bool deviceStillInField = m_nfc->inListPassiveTarget();

    while (deviceStillInField && counter > 0) {
      vTaskDelay(pdMS_TO_TICKS(50));
      m_nfc->inRelease();
      deviceStillInField = m_nfc->inListPassiveTarget();
      counter--;
    }
    
    if (deviceStillInField) {
        ESP_LOGW(TAG, "Tag was not removed from field, forcing RF field reset.");
        m_nfc->setRFField(0x02, 0x00);
        vTaskDelay(pdMS_TO_TICKS(100));
        m_nfc->setRFField(0x02, 0x01);
    } else {
        ESP_LOGD(TAG, "Tag removed.");
    }
    m_nfc->inRelease();
}